In [1]:
import pandas as pd

In [2]:
school_df =pd.read_csv('./Starter_Code/PyCitySchools/Resources/schools_complete.csv')

In [3]:
student_df =pd.read_csv('./Starter_Code/PyCitySchools/Resources/students_complete.csv')

This is how I write a notev(drop down where it says code and hit Markdown)

In [4]:
school_df

    School ID            school_name         type  size   budget
0           0      Huang High School   Government  2917  1910635
1           1   Figueroa High School   Government  2949  1884411
2           2    Shelton High School  Independent  1761  1056600
3           3  Hernandez High School   Government  4635  3022020
4           4    Griffin High School  Independent  1468   917500
5           5     Wilson High School  Independent  2283  1319574
6           6    Cabrera High School  Independent  1858  1081356
7           7     Bailey High School   Government  4976  3124928
8           8     Holden High School  Independent   427   248087
9           9       Pena High School  Independent   962   585858
10         10     Wright High School  Independent  1800  1049400
11         11  Rodriguez High School   Government  3999  2547363
12         12    Johnson High School   Government  4761  3094650
13         13       Ford High School   Government  2739  1763916
14         14     Thomas High School  Independent  1635  1043130

In [5]:
print('The number of unique schools is: ',len(school_df['School ID'].unique()))

The number of unique schools is:  15

In [6]:
student_df

,Student ID,student_name,gender,year,school_name,reading_score,maths_score
0,0,Paul Bradley,M,9,Huang High School,96,94
1,1,Victor Smith,M,12,Huang High School,90,43
2,2,Kevin Rodriguez,M,12,Huang High School,41,76
3,3,Richard Scott,M,12,Huang High School,89,86
4,4,Bonnie Ray,F,9,Huang High School,87,69
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12,Thomas High School,51,48
39166,39166,Dawn Bell,F,10,Thomas High School,81,89
39167,39167,Rebecca Tanner,F,9,Thomas High School,99,99
39168,39168,Desiree Kidd,F,10,Thomas High School,72,77
39169,39169,Carolyn Jackson,F,11,Thomas High School,47,62

In [7]:
print('The number of students is: ',len(student_df['Student ID'].unique()))

The number of students is:  39170

In [8]:
print('The total school budget is: ${}'.format(sum(school_df['budget'])))

The total school budget is: $24649428

In [9]:
print('The average maths score is: {}%'.format(student_df['maths_score'].mean()))

The average maths score is: 70.33819249425581%

In [10]:
print('The average reading score is: {}%'.format(student_df['reading_score'].mean()))

The average reading score is: 69.98013786060761%

In [11]:
print('The percentage of students who have passed maths is: {}%'.format((len(student_df[student_df['maths_score']>=50])/len(student_df['Student ID'].unique()))*100))

The percentage of students who have passed maths is: 86.07863160582077%

In [12]:
print('The percentage of students who have passed reading is: {}%'.format((len(student_df[student_df['reading_score']>=50])/len(student_df['Student ID'].unique()))*100))

The percentage of students who have passed reading is: 84.42685728874139%

In [17]:
print('The percentage of students who have passed both is: {}%'.format((len(student_df.loc[(student_df['reading_score']>=50) & (student_df['maths_score'] >= 50)])/len(student_df['Student ID'].unique()))*100))

The percentage of students who have passed both is: 72.80827163645647%

In [26]:
school_sum = pd.DataFrame(columns=['SchoolName', 'SchoolType', 'TotalStudents', 'TotalBudget', 'BudgetperStudent', 'AverageMathScore', 'AverageReadingScore', 'PercentagePassMath', 'PercentagePassRead', 'OverallPass'])

In [29]:
# Loop through unique school names
for school in school_df['school_name'].unique():
    school_data = school_df[school_df['school_name'] == school]
    student_school_df = student_df[student_df['school_name'] == school]

    # Calculate values
    sch_type = school_data['type'].values[0]
    num_students = len(student_school_df['Student ID'].unique())
    budget = float(school_data['budget'])
    budget_per_student = budget / num_students
    average_math = student_school_df['maths_score'].mean()
    average_read = student_school_df['reading_score'].mean()
    
    percent_pass_math = (student_school_df['maths_score'] >= 50).mean() * 100
    percent_pass_read = (student_school_df['reading_score'] >= 50).mean() * 100
    percent_pass_both = ((student_school_df['reading_score'] >= 50) & (student_school_df['maths_score'] >= 50)).mean() * 100

    # Create a row for the school
    row = [school, sch_type, num_students, budget, budget_per_student,
           average_math, average_read, percent_pass_math, percent_pass_read, percent_pass_both]
    
    # Append the row to the school_sum DataFrame
    school_sum.loc[len(school_sum)] = row
    print(row)

['Huang High School', 'Government', 2917, 1910635.0, 655.0, 68.93520740486801, 68.9105245114844, 81.6935207404868, 81.45354816592389, 66.71237572848817]
['Figueroa High School', 'Government', 2949, 1884411.0, 639.0, 68.69854187860291, 69.07799253984402, 81.65479823669041, 82.80773143438454, 67.65005086469989]
['Shelton High School', 'Independent', 1761, 1056600.0, 600.0, 72.03407155025553, 70.25780806360022, 91.53889835320841, 86.71209540034071, 78.87563884156728]
['Hernandez High School', 'Government', 4635, 3022020.0, 652.0, 68.87486515641855, 69.18640776699029, 80.94929881337649, 81.87702265372168, 66.3646170442287]
['Griffin High School', 'Independent', 1468, 917500.0, 625.0, 71.78814713896458, 71.24523160762942, 91.21253405994551, 88.48773841961854, 81.33514986376021]
['Wilson High School', 'Independent', 2283, 1319574.0, 578.0, 69.17082785808147, 68.87691633815156, 82.78580814717476, 81.29653964082347, 67.455102934735]
['Cabrera High School', 'Independent', 1858, 1081356.0, 582.0, 71.65715823466093, 71.35952637244348, 90.85037674919269, 89.07427341227125, 80.78579117330463]
['Bailey High School', 'Government', 4976, 3124928.0, 628.0, 72.35289389067525, 71.0088424437299, 91.63987138263666, 87.37942122186494, 80.08440514469454]
['Holden High School', 'Independent', 427, 248087.0, 581.0, 72.5831381733021, 71.66042154566745, 89.92974238875878, 88.52459016393442, 78.92271662763466]
['Pena High School', 'Independent', 962, 585858.0, 609.0, 72.08835758835758, 71.61330561330561, 91.68399168399168, 86.5904365904366, 79.20997920997921]
['Wright High School', 'Independent', 1800, 1049400.0, 583.0, 72.04722222222222, 70.96944444444445, 91.77777777777779, 86.66666666666667, 79.72222222222223]
['Rodriguez High School', 'Government', 3999, 2547363.0, 637.0, 72.04776194048512, 70.935983995999, 90.79769942485622, 87.39684921230307, 79.41985496374093]
['Johnson High School', 'Government', 4761, 3094650.0, 650.0, 68.84310018903592, 69.03927746271792, 82.06259189245957, 81.97857592942658, 67.19176643562277]
['Ford High School', 'Government', 2739, 1763916.0, 644.0, 69.09127418765974, 69.57247170500183, 82.43884629426798, 82.21978824388462, 67.46987951807229]
['Thomas High School', 'Independent', 1635, 1043130.0, 638.0, 69.5816513761468, 69.76880733944954, 83.85321100917432, 82.62996941896024, 69.48012232415903]

C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])
C:\Users\craig\AppData\Local\Temp\ipykernel_21488\1795357762.py:9: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  budget = float(school_data['budget'])

In [31]:
# Sort the school_sum DataFrame by % Overall Passing in descending order
top_schools = school_sum.sort_values(by='OverallPass', ascending=False)

# Display the top 5 rows
top_schools.head(5)

,SchoolName,SchoolType,TotalStudents,TotalBudget,BudgetperStudent,AverageMathScore,AverageReadingScore,PercentagePassMath,PercentagePassRead,OverallPass
4,Griffin High School,Independent,1468,917500.0,625.0,71.788147,71.245232,91.212534,88.487738,81.335150
19,Griffin High School,Independent,1468,917500.0,625.0,71.788147,71.245232,91.212534,88.487738,81.335150
6,Cabrera High School,Independent,1858,1081356.0,582.0,71.657158,71.359526,90.850377,89.074273,80.785791
21,Cabrera High School,Independent,1858,1081356.0,582.0,71.657158,71.359526,90.850377,89.074273,80.785791
7,Bailey High School,Government,4976,3124928.0,628.0,72.352894,71.008842,91.639871,87.379421,80.084405

In [32]:
# Sort the school_sum DataFrame by % Overall Passing in ascending order
bottom_schools = school_sum.sort_values(by='OverallPass', ascending=True)

# Display the top 5 rows
bottom_schools.head(5)

,SchoolName,SchoolType,TotalStudents,TotalBudget,BudgetperStudent,AverageMathScore,AverageReadingScore,PercentagePassMath,PercentagePassRead,OverallPass
3,Hernandez High School,Government,4635,3022020.0,652.0,68.874865,69.186408,80.949299,81.877023,66.364617
18,Hernandez High School,Government,4635,3022020.0,652.0,68.874865,69.186408,80.949299,81.877023,66.364617
0,Huang High School,Government,2917,1910635.0,655.0,68.935207,68.910525,81.693521,81.453548,66.712376
15,Huang High School,Government,2917,1910635.0,655.0,68.935207,68.910525,81.693521,81.453548,66.712376
27,Johnson High School,Government,4761,3094650.0,650.0,68.843100,69.039277,82.062592,81.978576,67.191766

In [44]:
# Create a pivot table to calculate average math scores for each grade at each school
math_scores_by_year = student_df.pivot_table(index='school_name', values='maths_score', aggfunc='mean', fill_value=0)

# Rename the columns for better readability
math_scores_by_year.rename(columns={
    '9th': '9th Grade Math Avg',
    '10th': '10th Grade Math Avg',
    '11th': '11th Grade Math Avg',
    '12th': '12th Grade Math Avg'
}, inplace=True)

# Display the DataFrame
math_scores_by_year.head()

                      maths_score
school_name
Bailey High School      72.352894
Cabrera High School     71.657158
Figueroa High School    68.698542
Ford High School        69.091274
Griffin High School     71.788147

In [46]:
# Create a pivot table to calculate average reading scores for each grade at each school
reading_scores_by_year = student_df.pivot_table(index='school_name', values='reading_score', aggfunc='mean', fill_value=0)

# Rename the columns for better readability
reading_scores_by_year.rename(columns={
    '9th': '9th Grade Reading Avg',
    '10th': '10th Grade Reading Avg',
    '11th': '11th Grade Reading Avg',
    '12th': '12th Grade Reading Avg'
}, inplace=True)

# Display the DataFrame
reading_scores_by_year.head()

                      reading_score
school_name
Bailey High School        71.008842
Cabrera High School       71.359526
Figueroa High School      69.077993
Ford High School          69.572472
Griffin High School       71.245232

In [55]:

# Define the spending bins and labels
spending_bins = [0, 585, 630, 645, 680]
spending_labels = ["<$585", "$585-630", "$630-645", "$645-680"]

# Add a new column to the 'per_school_summary' DataFrame to categorize schools based on spending
school_sum["Spending Ranges (Per Student)"] = pd.cut(school_sum["TotalBudget"], spending_bins, labels=spending_labels)

# Group the DataFrame by spending range
spending_grouped = school_sum.groupby("Spending Ranges (Per Student)")

# Calculate average math and reading scores for each spending range
average_math_scores = spending_grouped["AverageMathScore"].mean()
average_reading_scores = spending_grouped["AverageReadingScore"].mean()

# Calculate the percentage passing math, passing reading, and overall passing for each spending range
percent_passing_math = spending_grouped["PercentagePassMath"].mean()
percent_passing_reading = spending_grouped["PercentagePassRead"].mean()
percent_overall_passing = spending_grouped["OverallPass"].mean()

# Create a DataFrame to summarize school performance based on spending
spending_summary = pd.DataFrame({
    "AverageMathScore": average_math_scores,
    "AverageReadingScore": average_reading_scores,
    "PercentagePassMath": percent_passing_math,
    "PercentagePassRead": percent_passing_reading,
    "OverallPass": percent_overall_passing
})

# Display the spending summary DataFrame
print(spending_summary)

                               AverageMathScore  AverageReadingScore  \
Spending Ranges (Per Student)
<$585                                       NaN                  NaN
$585-630                                    NaN                  NaN
$630-645                                    NaN                  NaN
$645-680                                    NaN                  NaN

                               PercentagePassMath  PercentagePassRead  \
Spending Ranges (Per Student)
<$585                                         NaN                 NaN
$585-630                                      NaN                 NaN
$630-645                                      NaN                 NaN
$645-680                                      NaN                 NaN

                               OverallPass
Spending Ranges (Per Student)
<$585                                  NaN
$585-630                               NaN
$630-645                               NaN
$645-680                               NaN